In [1]:
import numpy as np
import pandas as pd

In [3]:
#comando concat, semelhante ao union all do sql

In [4]:
colunas = ['col1','col2','col3','col4']

In [27]:
dados1 =  np.array(list(map(lambda x: 'A' + str(x), range(16)))).reshape(4,4)
dados2 =  np.array(list(map(lambda x: 'B' + str(x), range(16)))).reshape(4,4)
dados3 =  np.array(list(map(lambda x: 'C' + str(x), range(16)))).reshape(4,4)
dados4 =  np.array(list(map(lambda x: 'D' + str(x), range(16)))).reshape(4,4)
dados5 =  np.array(list(map(lambda x: 'E' + str(x), range(16)))).reshape(4,4)

In [41]:
df1 = pd.DataFrame(dados1,columns=colunas)
df2 = pd.DataFrame(dados2,columns=colunas)
df3 = pd.DataFrame(dados3,columns=colunas)
df4 = pd.DataFrame(dados4,columns=colunas,index=[1,2,3,4])
df5 = pd.DataFrame(dados5,columns=colunas,index=[5,6,7,8])

In [35]:
df1

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15

In [36]:
df2

  col1 col2 col3 col4
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15

In [ ]:
#select * from df1 union all selec * from df2

In [32]:
pd.concat([df1,df2])

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15

In [34]:
pd.concat([df1,df2,df3])

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15
0   C0   C1   C2   C3
1   C4   C5   C6   C7
2   C8   C9  C10  C11
3  C12  C13  C14  C15

In [ ]:
#select df1.col1, df1.col2, df2.col3, df2.col4 from df1 inner join df2 on 1 = 1

In [38]:
#semelhante a um join no sql
pd.concat([df1,df2],axis=1)

  col1 col2 col3 col4 col1 col2 col3 col4
0   A0   A1   A2   A3   B0   B1   B2   B3
1   A4   A5   A6   A7   B4   B5   B6   B7
2   A8   A9  A10  A11   B8   B9  B10  B11
3  A12  A13  A14  A15  B12  B13  B14  B15

In [39]:
pd.concat([df1,df2,df3],axis=1)

  col1 col2 col3 col4 col1 col2 col3 col4 col1 col2 col3 col4
0   A0   A1   A2   A3   B0   B1   B2   B3   C0   C1   C2   C3
1   A4   A5   A6   A7   B4   B5   B6   B7   C4   C5   C6   C7
2   A8   A9  A10  A11   B8   B9  B10  B11   C8   C9  C10  C11
3  A12  A13  A14  A15  B12  B13  B14  B15  C12  C13  C14  C15

In [42]:
df4

  col1 col2 col3 col4
1   D0   D1   D2   D3
2   D4   D5   D6   D7
3   D8   D9  D10  D11
4  D12  D13  D14  D15

In [43]:
df5

  col1 col2 col3 col4
5   E0   E1   E2   E3
6   E4   E5   E6   E7
7   E8   E9  E10  E11
8  E12  E13  E14  E15

In [44]:
pd.concat([df4,df5])

  col1 col2 col3 col4
1   D0   D1   D2   D3
2   D4   D5   D6   D7
3   D8   D9  D10  D11
4  D12  D13  D14  D15
5   E0   E1   E2   E3
6   E4   E5   E6   E7
7   E8   E9  E10  E11
8  E12  E13  E14  E15

In [92]:
#select col1, col2, null as col3, null as col4  from t1 union all select null as col1, null as col2, col3, col4 from t2

In [45]:
pd.concat([df4,df5],axis=1)

  col1 col2 col3 col4 col1 col2 col3 col4
1   D0   D1   D2   D3  NaN  NaN  NaN  NaN
2   D4   D5   D6   D7  NaN  NaN  NaN  NaN
3   D8   D9  D10  D11  NaN  NaN  NaN  NaN
4  D12  D13  D14  D15  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN   E0   E1   E2   E3
6  NaN  NaN  NaN  NaN   E4   E5   E6   E7
7  NaN  NaN  NaN  NaN   E8   E9  E10  E11
8  NaN  NaN  NaN  NaN  E12  E13  E14  E15

In [ ]:
#select t1.*, t2.* from t1 inner join t2 on t1.id = t2.key

In [59]:
colunas = ['id','nome','numero']
dados1 = [[0,'a',55.0,],[1,'b',12.0],[2,'c',98.5]]
dados2 = [[0,'a',32.8],[2,'d',871.9],[4,'e',812.123]]
left = pd.DataFrame(dados1,columns=colunas)
right = pd.DataFrame(dados2,columns=colunas)

In [60]:
left

   id nome  numero
0   0    a    55.0
1   1    b    12.0
2   2    c    98.5

In [61]:
right

   id nome   numero
0   0    a   32.800
1   2    d  871.900
2   4    e  812.123

In [62]:
pd.merge(left,right,how='inner',on='id')

   id nome_x  numero_x nome_y  numero_y
0   0      a      55.0      a      32.8
1   2      c      98.5      d     871.9

In [ ]:
#select t1.*, t2.* from t1 left join t2 on t1.id = t2.key

In [63]:
pd.merge(left,right,how='left',on='id')

   id nome_x  numero_x nome_y  numero_y
0   0      a      55.0      a      32.8
1   1      b      12.0    NaN       NaN
2   2      c      98.5      d     871.9

In [ ]:
#select t1.*, t2.* from t1 right join t2 on t1.id = t2.key

In [58]:
pd.merge(left,right,how='right',on='id')

   id nome_x  numero_x nome_y  numero_y
0   0      a      55.0      a    32.800
1   2      c      98.5      c   871.900
2   4    NaN       NaN      e   812.123

In [93]:
#select t1.*, t2.* from t1 inner join t2 on t1.id = t2.key and t1.nome = t2.nome

In [65]:
pd.merge(left,right,how='inner',on=['id','nome'])

   id nome  numero_x  numero_y
0   0    a      55.0      32.8

In [66]:
pd.merge(left,right,how='xx',on='id')

KeyError: 'xx'

In [80]:
index_df1 = ['i1','i2','i3','i4']
index_df2 = ['i1','i3','i4','i5']
dados1 =  np.array(list(map(lambda x: 'A' + str(x), range(16)))).reshape(4,4)
dados2 =  np.array(list(map(lambda x: 'B' + str(x), range(16)))).reshape(4,4)

In [81]:
df1 = pd.DataFrame(dados1,columns=['A','B','C','D'],index=index_df1)
df2 = pd.DataFrame(dados2,columns=['E','F','G','H'],index=index_df2)

In [82]:
#faz um left join pelo index
df1.join(df2)

      A    B    C    D    E    F    G    H
i1   A0   A1   A2   A3   B0   B1   B2   B3
i2   A4   A5   A6   A7  NaN  NaN  NaN  NaN
i3   A8   A9  A10  A11   B4   B5   B6   B7
i4  A12  A13  A14  A15   B8   B9  B10  B11

In [84]:
df1.join(df2,how='outer')

      A    B    C    D    E    F    G    H
i1   A0   A1   A2   A3   B0   B1   B2   B3
i2   A4   A5   A6   A7  NaN  NaN  NaN  NaN
i3   A8   A9  A10  A11   B4   B5   B6   B7
i4  A12  A13  A14  A15   B8   B9  B10  B11
i5  NaN  NaN  NaN  NaN  B12  B13  B14  B15

In [85]:
#distinct do sql em pandas

In [161]:
dados = {'id':[111111,111111,2222222,2222222],'nomes':['anderson','ueda','miura','sandro'],'valores':[1231,545,4637,675]}
df = pd.DataFrame(dados)

In [162]:
df

        id     nomes  valores
0   111111  anderson     1231
1   111111      ueda      545
2  2222222     miura     4637
3  2222222    sandro      675

In [94]:
#select distinct id from t1

In [101]:
df['id'].unique()

array([ 111111, 2222222], dtype=int64)

In [ ]:
#select id,count(*) from t1 group by id

In [102]:
df['id'].value_counts()

111111     2
2222222    2
Name: id, dtype: int64

In [165]:
#select * from df1 where id = 2222222

In [166]:
df.where(df['id'] == 2222222)

          id   nomes  valores
0        NaN     NaN      NaN
1        NaN     NaN      NaN
2  2222222.0   miura   4637.0
3  2222222.0  sandro    675.0

In [167]:
df.where(df['id'] == 2222222).dropna()

          id   nomes  valores
2  2222222.0   miura   4637.0
3  2222222.0  sandro    675.0

In [ ]:
#apply, aplica uma função a todos os valores de uma coluna

In [137]:
def dobro(n):
    return n*2

In [138]:
df['nomes'].apply(len)

0    8
1    4
2    5
3    6
Name: nomes, dtype: int64

In [139]:
df['id'].apply(dobro)

0     222222
1     222222
2    4444444
3    4444444
Name: id, dtype: int64

In [141]:
df['valores'].apply(lambda x: x**2)

0     1515361
1      297025
2    21501769
3      455625
Name: valores, dtype: int64

In [ ]:
df['id'] = df['id'].apply(lambda x: x * 2)

In [176]:
df.sort_values('nomes')

        id     nomes  valores
0   222222  anderson     1231
2  4444444     miura     4637
3  4444444    sandro      675
1   222222      ueda      545

In [177]:
del df['nomes']

In [178]:
df

        id  valores
0   222222     1231
1   222222      545
2  4444444     4637
3  4444444      675

In [179]:
df[['id','valores']]

        id  valores
0   222222     1231
1   222222      545
2  4444444     4637
3  4444444      675

        id     nomes  valores
0   111111  anderson     1231
2  2222222     miura     4637
3  2222222    sandro      675
1   111111      ueda      545